In [8]:
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# ------------------------------------------------------------------------------
from scipy.stats import shapiro, kstest

# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

from src import soporte_correlacion as sc

In [61]:
df_clientes = pd.read_csv("files/clientes.csv")

In [62]:
df_productos = pd.read_csv("files/productos.csv")

In [63]:
df_ventas = pd.read_csv("files/ventas.csv")

In [64]:
df_clientes.head(2)

,id,first_name,last_name,email,gender,City,Country,Address
0,1,Cheri,Dunsmore,cdunsmore0@instagram.com,Female,Palma De Mallorca,Spain,076 Rockefeller Crossing
1,2,Hunt,Bartomeu,hbartomeu1@nsw.gov.au,Male,Lugo,Spain,0046 Utah Junction

In [65]:
df_productos.head(2)

,ID,Nombre_Producto,Categoría,Precio,Origen,Descripción
0,A1,Pizza Margherita,Platos Preparados,8.99,Italia,"Clásica pizza italiana con tomate, mozzarella ..."
1,B2,Risotto de Champiñones,Platos Preparados,6.75,Italia,"Risotto cremoso con champiñones frescos, una d..."

In [66]:
df_ventas.head(2)

   ID_Cliente ID_Producto Fecha_Venta  Cantidad  Total
0         723          A1  2023-11-22         2  17.98
1         498          C3  2023-11-21         1   5.49

In [17]:
df_clientes.shape

(1000, 8)

In [18]:
df_clientes.size

8000

In [20]:
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
 3   email       973 non-null    object
 4   gender      923 non-null    object
 5   City        876 non-null    object
 6   Country     846 non-null    object
 7   Address     959 non-null    object
dtypes: int64(1), object(7)
memory usage: 62.6+ KB

In [22]:
df_clientes.describe().T

     count   mean         std  min     25%    50%     75%     max
id  1000.0  500.5  288.819436  1.0  250.75  500.5  750.25  1000.0

In [30]:
df_clientes.value_counts().sum()

np.int64(641)

In [27]:
df_clientes.isnull().sum()

id              0
first_name      0
last_name       0
email          27
gender         77
City          124
Country       154
Address        41
dtype: int64

In [ ]:
df_clientes.isnull()

In [31]:
df_clientes.isnull().sum()/df_clientes.shape[0]*100

id             0.0
first_name     0.0
last_name      0.0
email          2.7
gender         7.7
City          12.4
Country       15.4
Address        4.1
dtype: float64

In [36]:
df_clientes.groupby("City").size().sort_values(ascending=False)

City
Madrid                                      51
Granada                                     42
Palma De Mallorca                           41
Malaga                                      36
Vitoria-Gasteiz                             32
Palmas De Gran Canaria, Las                 31
Pamplona/Iruña                              27
Valencia                                    27
Pontevedra                                  24
Cadiz                                       24
Sevilla                                     24
Lleida                                      23
Santander                                   22
Valladolid                                  22
Zamora                                      22
Donostia-San Sebastian                      21
Leon                                        20
Vigo                                        20
Logroño                                     20
Albacete                                    20
Badajoz                                     18
Barcelona                                   18
Santiago De Compostela                      18
Almeria                                     17
Murcia                                      17
Coruña, A                                   15
Castellon De La Plana/Castello De La Pla    13
Cartagena                                   12
Jaen                                        12
Sabadell                                    11
Huesca                                      10
Getafe                                      10
Ceuta                                       10
Gijon                                       10
Fuenlabrada                                  9
Leganes                                      8
Girona                                       8
Ferrol                                       8
Tarragona                                    8
Palencia                                     8
Teruel                                       8
Salamanca                                    7
Elx/Elche                                    7
Dos Hermanas                                 7
Ourense                                      7
Toledo                                       7
Lugo                                         7
Aviles                                       6
Hospitalet De Llobregat, L'                  6
Telde                                        6
Zaragoza                                     5
Santa Cruz De Tenerife                       5
Alicante/Alacant                             3
Sant Cugat Del Valles                        3
Torrevieja                                   3
dtype: int64

In [37]:
df_clientes.duplicated(subset="City", keep=False).sum()

np.int64(1000)

In [67]:
df_clientes[df_clientes.duplicated(subset="City", keep=False)].sort_values("City").head(4)

,id,first_name,last_name,email,gender,City,Country,Address
320,321,Tynan,Oty,toty8w@nymag.com,Male,Albacete,NaN,02 Reindahl Terrace
71,72,Niki,Corsor,ncorsor1z@wp.com,NaN,Albacete,Spain,91 Vidon Pass
248,249,Aloise,McKillop,amckillop6w@sfgate.com,Genderqueer,Albacete,Spain,47138 Fieldstone Road
373,374,Dominica,Aslum,daslumad@ezinearticles.com,Female,Albacete,Spain,3 Armistice Lane

In [ ]:
df_clientes["email"].duplicated().sum() #Hay 0 ID duplicados, pero tenemos 26 emails duplicados

np.int64(26)

crear función